In [2]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [3]:
dframe1 = DataFrame(np.arange(8).reshape(2,4),index=pd.Index(['LA','SF'],name ='city'),
columns=pd.Index(['A','B','C','D'],name="letter"))

dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [4]:
dframe_st = dframe1.stack()

dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int32

In [6]:
ser1 = Series([0,1,2],index=["Q",'X','Y'])

ser2 = Series([4,5,6],index=['X','Y','Z'])

In [7]:
dframe = pd.concat([ser1,ser2],keys=['alpha','beta'])

dframe

alpha  Q    0
       X    1
       Y    2
beta   X    4
       Y    5
       Z    6
dtype: int64

In [8]:
dframe.unstack()

         Q    X    Y    Z
alpha  0.0  1.0  2.0  NaN
beta   NaN  4.0  5.0  6.0

In [9]:
dframe = DataFrame({'key1':['A']*2 + ['B']*3,'key2':[2,2,2,3,3]})

dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [10]:
dframe.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [11]:
dframe.drop_duplicates()

  key1  key2
0    A     2
2    B     2
3    B     3

In [12]:
dframe.drop_duplicates('key1')

  key1  key2
0    A     2
2    B     2

In [13]:
dframe = DataFrame({'city':['Alma','brian head','Fox park'],'altitude':[3158,3000,2762]})
dframe

         city  altitude
0        Alma      3158
1  brian head      3000
2    Fox park      2762

In [20]:
state_map = {'Alma':'colorado','brian head':'utah','Fox park':'Wyoming'}

In [21]:
dframe['state'] = dframe['city'].map(state_map)

In [22]:
dframe

         city  altitude     state
0        Alma      3158  colorado
1  brian head      3000      utah
2    Fox park      2762   Wyoming

In [24]:
ser = Series([1,2,3,4,1,2,3,4])

ser

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [25]:
ser.replace(1,np.nan)

0    NaN
1    2.0
2    3.0
3    4.0
4    NaN
5    2.0
6    3.0
7    4.0
dtype: float64

In [26]:
ser.replace([1,4],[100,400])

0    100
1      2
2      3
3    400
4    100
5      2
6      3
7    400
dtype: int64

In [27]:
dframe = DataFrame(np.arange(12).reshape(3,4),index=['NY','LA','SF'],columns =['A','B','C','D'])

dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [28]:
dframe.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [29]:
dframe.index = dframe.index.map(str.lower)

In [30]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [31]:
dframe.rename(index=str.title, columns=str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [34]:
dframe.rename(index={'ny':"new york"},columns={'A':'alpha'})

          alpha  B   C   D
new york      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [35]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [36]:
dframe.rename(index={'ny':"new york"},inplace=True)

In [37]:
dframe

          A  B   C   D
new york  0  1   2   3
la        4  5   6   7
sf        8  9  10  11

In [39]:
years = [1998,1986,1952,2008,2009,2012,1999,1986,1993]

years

[1998, 1986, 1952, 2008, 2009, 2012, 1999, 1986, 1993]

In [40]:
decade_bins = [1960,1970,1980,1990,2000,2010,2020]

In [41]:
dcade_cat = pd.cut(years,decade_bins)

dcade_cat

[(1990.0, 2000.0], (1980.0, 1990.0], NaN, (2000.0, 2010.0], (2000.0, 2010.0], (2010.0, 2020.0], (1990.0, 2000.0], (1980.0, 1990.0], (1990.0, 2000.0]]
Categories (6, interval[int64, right]): [(1960, 1970] < (1970, 1980] < (1980, 1990] < (1990, 2000] < (2000, 2010] < (2010, 2020]]

In [42]:
pd.value_counts(dcade_cat)

(1990, 2000]    3
(1980, 1990]    2
(2000, 2010]    2
(2010, 2020]    1
(1960, 1970]    0
(1970, 1980]    0
dtype: int64

In [44]:
pd.cut(years,5)

[(1988.0, 2000.0], (1976.0, 1988.0], (1951.94, 1964.0], (2000.0, 2012.0], (2000.0, 2012.0], (2000.0, 2012.0], (1988.0, 2000.0], (1976.0, 1988.0], (1988.0, 2000.0]]
Categories (5, interval[float64, right]): [(1951.94, 1964.0] < (1964.0, 1976.0] < (1976.0, 1988.0] < (1988.0, 2000.0] < (2000.0, 2012.0]]

In [45]:
np.random.seed(12345)

In [46]:
dframe = DataFrame(np.random.randn(1000,4))

In [48]:
dframe.head()

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570

In [47]:
dframe.tail()

            0         1         2         3
995  1.089085  0.251232 -1.451985  1.653126
996 -0.478509 -0.010663 -1.060881 -1.502870
997 -1.946267  1.013592  0.037333  0.133304
998 -1.293122 -0.322542 -0.782960 -0.303340
999  0.089987  0.292291  1.177706  0.882755

In [49]:
dframe.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [50]:
col = dframe[0]

In [52]:
col.head()

0   -0.204708
1    1.965781
2    0.769023
3    0.274992
4   -2.001637
Name: 0, dtype: float64

In [54]:
col[np.abs(col)>3]

523   -3.428254
900    3.366626
Name: 0, dtype: float64

In [55]:
dframe[(np.abs(dframe)>3).any(1)]

C:\Users\sanja\AppData\Local\Temp\ipykernel_7800\1898448401.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  dframe[(np.abs(dframe)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846